#+title:     Exercises in SICP Chapter 5
#+author:    Jason Huang
#+email:     huangmianrui0310@outlook.com
#+date:      <2021-04-08 Thu>

#+description:  Exercises and solutions in SICP chapter 5
#+keywords:     sicp, exercises, solutions, lisp, scheme
#+language:     en
#+startup:      content
#+exclude_tags: noexport

*** Solution

#+name: find-variable
#+begin_src scheme :noweb yes
(define (find-variable var env)
  (define (lookup-frame num frames)
    (if (null? frames)
        'not-found
        (let ((displacement (lookup-variable 0 (car frames))))
          (if displacement
              (list num displacement)
              (lookup-frame (+ num 1) (cdr frames))))))
  (define (lookup-variable displacement frame)
    (cond ((null? frame) false)
          ((eq? var (car frame)) displacement)
          (else (lookup-variable (+ displacement 1) (cdr frame)))))
  (lookup-frame 0 env))
#+end_src

#+begin_src scheme :noweb yes :results output
<<find-variable>>
(display (find-variable 'c '((y z) (a b c d e) (x y)))) (newline)
(display (find-variable 'x '((y z) (a b c d e) (x y)))) (newline)
(display (find-variable 'w '((y z) (a b c d e) (x y)))) (newline)
#+end_src

#+RESULTS:
: (1 2)
: (2 0)
: not-found

